Merge pull request #5 from fabianwimberger/develop
Update: Add Reverse-Proxy config and update docs / best practises
